// ignore_for_file: prefer_const_declarations

final String questionText = """
解答の保存と編集:
アンケートにおいて、解答を保存して次のページに進むと、保存した解答の編集はできません。入力内容に不備や誤りを感じた場合、次のページに進む前に十分に確認してください。
誤りが生じた場合の対応:
アンケート途中で誤りが生じた場合、一度アンケートを終了し、新たにアンケートを開始してください。前のページに戻ることはできませんので、新規に開始することで正確な情報を提供できます。
プライバシーと誓約書:
解答の保存や個人情報の取り扱いに関する詳細は、アンケート誓約書ページをご覧ください。こちらにはプライバシー保護に関する重要な情報が含まれていますので、慎重にお読みいただき、同意の上でアンケートにご参加ください。
セキュリティへの留意:
アンケートにアクセスする際は、現状のアプリの場合ではネット通信は使用しませんが、自然言語処理を利用されるときには、安全なネットワーク環境を使用してください。\n公共の場でのアクセスや、不正アクセスが可能な環境での利用は避け、個人デバイスを使用してください。
""";
