const String writtenOathText = """

私たちは、以下にご記載の条件でアンケートを実施しております。アンケートにお答えいただいたデータは、以下の条件で使用されます。

目的: 
  アンケートの目的に基づき、データは統計分析、研究、および関連する活動に使用されます。現段階ではChatGPTへの入力は手動で行われますが、将来のアップデートで自動的に行われる可能性があります。

匿名性: 
  収集されたデータは匿名であり、データの統計分析、研究、および関連する活動で使用される場合では、個別の被験者が特定できる情報は含まれません。

ChatGPTへの入力: 
  アンケートの内容は、現段階では手動でChatGPTに入力されますが、将来のアップデートで自動的に入力される可能性があります。この点についても同意いただきます。

組織やDAOへの開示: 
  アンケートデータは、法的な手続きなしに組織やDAOに開示される可能性があります。ただし、この選択肢はアンケートを行った方もしくはアンケートを行ったアプリを所有している者に一任され、こちら側はその選択に対する責任を負いません。

同意の変更について: 
  アンケートデータの使用に関する同意事項が変更された場合、こちら側はその変更に同意するものとし、同意の変更に関する追加の通知は行いません。最新の同意事項に従うことを承諾します。

責任の免除: 
  アンケートデータの開示に関する選択およびその結果については、アンケートを行った方もしくはアプリの所有者が責任を負います。こちら側はその責任を持たないものとし、一切の損害に対して責任を負いません。

上記の条件に同意いただける場合は、以下にお名前と日付をご記入いただき、ご署名をお願いいたします。
""";
